{
    "raw_content": "Properties For Sale in West London | Rightmove Skip to content open-rightmove-assistant burger_menu Buy Property for sale New homes for sale Property valuation Investors Mortgages Rent Property to rent Student property to rent House Prices Sold house prices Property valuation Instant online valuation Find Agent Find estate agents Commercial Commercial property to rent Commercial property for sale Advertise commercial property Inspire Moving stories Property\nnews Energy efficiency Property\nguides Housing trends Mortgage guides Overseas blog Country guides Overseas All countries Spain France Portugal Italy Greece Currency Sell overseas property Sign in My Rightmove open-rightmove-assistant log_in Sign\nin My Rightmove Buy Property for sale New\nhomes for sale Property\nvaluation Investors Mortgages Rent Property to rent Student property to rent Find Agent Find estate agents House prices Sold house prices Instant online valuation Commercial Commercial property to rent Commercial property for sale Advertise Inspire Moving\nstories Property news Energy\nefficiency Property\nguides Housing trends Overseas blog Mortgage guides Overseas All countries Spain France Portugal Italy Greece Currency Sell Overseas property Clear + 1/2 mile + 0 miles + 1/4 mile + 1/2 mile + 1 mile + 3 miles + 5 miles + 10 miles + 15 miles + 20 miles + 30 miles + 40 miles Price: Min Price Min Price £50,000 £60,000 £70,000 £80,000 £90,000 £100,000 £110,000 £120,000 £125,000 £130,000 £140,000 £150,000 £160,000 £170,000 £175,000 £180,000 £190,000 £200,000 £210,000 £220,000 £230,000 £240,000 £250,000 £260,000 £270,000 £280,000 £290,000 £300,000 £325,000 £350,000 £375,000 £400,000 £425,000 £450,000 £475,000 £500,000 £550,000 £600,000 £650,000 £700,000 £800,000 £900,000 £1,000,000 £1,250,000 £1,500,000 £1,750,000 £2,000,000 £2,500,000 £3,000,000 £4,000,000 £5,000,000 £7,500,000 £10,000,000 £15,000,000 £20,000,000 Min Price to Max Price Max Price £50,000 £60,000 £70,000 £80,000 £90,000 £100,000 £110,000 £120,000 £125,000 £130,000 £140,000 £150,000 £160,000 £170,000 £175,000 £180,000 £190,000 £200,000 £210,000 £220,000 £230,000 £240,000 £250,000 £260,000 £270,000 £280,000 £290,000 £300,000 £325,000 £350,000 £375,000 £400,000 £425,000 £450,000 £475,000 £500,000 £550,000 £600,000 £650,000 £700,000 £800,000 £900,000 £1,000,000 £1,250,000 £1,500,000 £1,750,000 £2,000,000 £2,500,000 £3,000,000 £4,000,000 £5,000,000 £7,500,000 £10,000,000 £15,000,000 £20,000,000 Max Price Bedrooms: 3 Bed Min Beds Studio 1 Bed 2 Bed 3 Bed 4 Bed 5 Bed 6 Bed 7 Bed 8 Bed 9 Bed 10 Bed Min Beds to Max Beds Max Beds Studio 1 Bed 2 Bed 3 Bed 4 Bed 5 Bed 6 Bed 7 Bed 8 Bed 9 Bed 10 Bed Max Beds Property Type (3) Filters Property Type (3) Detached Semi-detached Terraced Flat Bungalow Land Park Home 2,024 results Done + 1/2 mile + 0 miles + 1/4 mile + 1/2 mile + 1 mile + 3 miles + 5 miles + 10 miles + 15 miles + 20 miles + 30 miles + 40 miles Price: Min Price Min Price £50,000 £60,000 £70,000 £80,000 £90,000 £100,000 £110,000 £120,000 £125,000 £130,000 £140,000 £150,000 £160,000 £170,000 £175,000 £180,000 £190,000 £200,000 £210,000 £220,000 £230,000 £240,000 £250,000 £260,000 £270,000 £280,000 £290,000 £300,000 £325,000 £350,000 £375,000 £400,000 £425,000 £450,000 £475,000 £500,000 £550,000 £600,000 £650,000 £700,000 £800,000 £900,000 £1,000,000 £1,250,000 £1,500,000 £1,750,000 £2,000,000 £2,500,000 £3,000,000 £4,000,000 £5,000,000 £7,500,000 £10,000,000 £15,000,000 £20,000,000 Min Price to Max Price Max Price £50,000 £60,000 £70,000 £80,000 £90,000 £100,000 £110,000 £120,000 £125,000 £130,000 £140,000 £150,000 £160,000 £170,000 £175,000 £180,000 £190,000 £200,000 £210,000 £220,000 £230,000 £240,000 £250,000 £260,000 £270,000 £280,000 £290,000 £300,000 £325,000 £350,000 £375,000 £400,000 £425,000 £450,000 £475,000 £500,000 £550,000 £600,000 £650,000 £700,000 £800,000 £900,000 £1,000,000 £1,250,000 £1,500,000 £1,750,000 £2,000,000 £2,500,000 £3,000,000 £4,000,000 £5,000,000 £7,500,000 £10,000,000 £15,000,000 £20,000,000 Max Price Bedrooms: 3 Bed Min Beds Studio 1 Bed 2 Bed 3 Bed 4 Bed 5 Bed 6 Bed 7 Bed 8 Bed 9 Bed 10 Bed Min Beds to Max Beds Max Beds Studio 1 Bed 2 Bed 3 Bed 4 Bed 5 Bed 6 Bed 7 Bed 8 Bed 9 Bed 10 Bed Max Beds Property Type: Property Type (3) Detached Semi-detached Terraced Flat Bungalow Land Park Home Added to Site: Added: Anytime Anytime Last 24 hours Last 3 days Last 7 days Last 14 days Include Under Offer, Sold STC ? Must Haves: Must Haves Garden Parking New Home Retirement Home Buying Schemes Auction Property Don't Show: Don't Show New Home Retirement Home Buying Schemes 2,024 results Clear Done Houses For Sale in West London, at least 3 beds, within 0.5 miles Save search Create Alert Notify me about... Houses For Sale in West London, at least 3 beds, within 0.5 miles Instantly Daily Every 3 days Every 7 days Create Alert Sort: Highest Price Lowest Price Newest Listed Oldest Listed List Map 2,024 results Prioritise properties with... Add keyword We couldn't find what you’re looking for right now Here’s what you can try to find more properties: Property image 1 of 11 1/11 Featured Property £1,595,000 Fabian Road, Fulham, London, SW6 House 4 bedrooms 4 2 bathrooms 2 A beautifully presented four double bedroom, two bathroom family home with a west facing garden, a stone’s throw to the excellent shops, bars, restaurants and underground (District Line) at Fulham Broadway. On the ground floor, there is a double reception room, guest WC and an extended kitc... Added on 21/01/2025 by Lawson Rutter, Fulham Added on 21/01/2025 020 3866 6800 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Property image 1 of 15 1/15 £1,950,000 Guide Price Bonchurch Road, London, W10 Terraced 3 bedrooms 3 3 bathrooms 3 Fabulous 3 bedroom townhouse with large garden and underground parking in a sought-after Notting Hill development Added on 25/09/2023 by Sandersons, Holland Park & Notting Hill Added on 25/09/2023 020 3893 8800 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Property image 1 of 12 1/12 £1,950,000 Offers in Excess of Chesilton Road, Fulham, London, SW6 House 5 bedrooms 5 2 bathrooms 2 Set along a quiet residential road within moments of central Fulham and Parsons Green this grand 5 bedroom house is gorgeously presented throughout, offering an expansive living space and quality fittings. Reduced on 15/01/2025 by Foxtons, Fulham Broadway Reduced on 15/01/2025 020 3840 3529 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Property image 1 of 25 1/25 £1,950,000 Guide Price Beaufort Road, London, W5 Detached 5 bedrooms 5 2 bathrooms 2 Spacious 5-bedroom detached home over three floors with period features, large secluded garden, and parking. Located in the sought-after Hanger Hill East Conservation Area, close to stations, shopping, schools, and excellent transport links Added on 27/09/2024 by Moveli, London & Country Added on 27/09/2024 020 3906 1015 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Property image 1 of 27 1/27 £1,950,000 Guide Price Beaufort Road, London, W5 3EB Detached 5 bedrooms 5 3 bathrooms 3 For All Enquiries Please Quote AK0951. Guide Price: £1,750,000 - £1,950,000\nWelcome to this beautiful five-bedroom detached, double-fronted corner property, elegantly spread across three floors. Thoughtfully designed, it retains charming period features such as parquet wood ... Reduced on 15/11/2024 by eXp UK, London Reduced on 15/11/2024 03304 609968 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Property image 1 of 18 showing 41.jpg 1/18 £1,950,000 Guide Price High Specification Festing Road, Putney, SW15 Terraced 4 bedrooms 4 3 bathrooms 3 This beautifully refurbished and extended period home on Festing Road offers a perfect blend of classic charm and modern sophistication. Located just moments from the River Thames and with views of the tranquil Leaders Gardens, the property boasts a stunning design that combines original period f... Added on 04/02/2025 by James Anderson, Putney - Sales Added on 04/02/2025 020 3871 8690 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/13 £1,950,000 Guide Price Trinity Church Road Town House 4 bedrooms 4 3 bathrooms 3 A beautiful terraced town house in this popular Riverside development ideal for the Swedish School, St Paul's and The Harrodian, as well as being within walking distance of Hammersmith Station. The property has 4 bedrooms, 3 bathrooms, guest w.c., eat-in kitchen, conservatory, first floor recepti... Added on 21/01/2025 by Village Properties, London Added on 21/01/2025 020 3834 7969 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/20 £1,950,000 Premium Listing Uverdale Road, London, SW10 Terraced 4 bedrooms 4 3 bathrooms 3 Summary Description\nA stunning four-bedroom period home in the heart of Chelsea, offering a perfect blend of charm, space, and modern convenience., perfect for families. This beautifully arranged townhouse spans three floors, featuring a spacious reception room, a sleek kitchen, four well-proport... Added on 07/02/2025 by Purplebricks, covering South West London Added on 07/02/2025 020 3897 7789 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/27 £1,950,000 Wormholt Road, Shepherd's Bush, London, W12 Terraced 5 bedrooms 5 2 bathrooms 2 Located on a residential street in Shepherds Bush, The Aspen is an exceptional five-bedroom family home. Renovated beautifully, boasting lateral spaces finished with a high quality build, design and appliance range.. Added on 01/02/2025 by Foxtons, Shepherds Bush Added on 01/02/2025 020 3908 5056 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/18 £1,950,000 Heathcroft, Ealing, London, W5 House 4 bedrooms 4 3 bathrooms 3 Featuring beautifully refurbished interiors, this stunning 4 bedroom family house boasts a fabulous reception room with bi folding garden doors, contemporary kitchen, landscaped garden and secure off street parking. Reduced on 05/02/2025 by Foxtons, Ealing Reduced on 05/02/2025 020 3909 9640 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/16 £1,925,000 Period Property Brackley Road, London, W4 Terraced 4 bedrooms 4 3 bathrooms 3 An exceptional family house situated on a highly desirable road in the heart of Chiswick. Added on 13/01/2025 by Hamptons, Chiswick Added on 13/01/2025 020 3869 5317 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/15 £1,900,000 Eccles Road, Clapham Junction House 4 bedrooms 4 4 bathrooms 4 This architecturally impressive Victorian home has been meticulously designed & fully extended/refurbished. It measures over 1,800 Sq Ft. Including four bedrooms, four bathrooms (All en-suites), two reception rooms, a fully extended eat-in kitchen & a private garden. The property benefits further... Added on 27/01/2025 by Dexters, Northcote Road Added on 27/01/2025 020 7483 6333 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/19 £1,900,000 Offers in Excess of Period Features Lavender Gardens, London, SW11 Terraced 5 bedrooms 5 2 bathrooms 2 A beautifully elegant and wonderfully presented five double bedroom Victorian family home with landscaped garden, situated just off Clapham Common. Added on 19/11/2024 by Hamptons, Battersea & Wandsworth Added on 19/11/2024 020 3909 6503 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/13 £1,900,000 Guide Price Premium Listing New Kings Road, Fulham, London, SW6 Terraced 3 bedrooms 3 2 bathrooms 2 A Georgian house full of character and charm overlooking Eel Brook Common. Reduced on 13/01/2025 by Savills, Fulham Reduced on 13/01/2025 020 3866 5514 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/19 £1,900,000 Eccles Road,\nClapham Junction, SW11 Terraced 4 bedrooms 4 4 bathrooms 4 A fantastic four bedroom family home. Added on 29/01/2025 by Chestertons, Battersea Added on 29/01/2025 020 3835 2140 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/21 £1,900,000 Guide Price Garfield Road, London, SW11 Terraced 5 bedrooms 5 3 bathrooms 3 A wider than average, beautifully light, five bedroom family home with a stunning west facing garden. Added on 16/10/2024 by Savills, Northcote Road Added on 16/10/2024 020 3909 8942 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/19 £1,900,000 Offers in Excess of Old Church Street, London, SW3 Mews 3 bedrooms 3 3 bathrooms 3 Stunning Newly Refurbished 3-Bedroom Townhouse with Off-Street Parking Reduced on 30/01/2025 by DDRE.global, London Reduced on 30/01/2025 020 8078 8474 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/18 £1,900,000 Off-Street Parking Bonchurch Road, Notting Hill, London, W10 Terraced 3 bedrooms 3 2 bathrooms 2 A modern immaculately presented three-bedroom townhouse with a private terrace and two underground parking spaces, tucked behind Golborne Road in Portobello Square, W10. The house has been tastefully refurbished to the highest specification, incorporating contemporary finishes, bespoke wardrobes,... Added on 08/11/2024 by Michael Graham, Kensington & Chelsea Added on 08/11/2024 020 8016 2362 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/16 £1,900,000 Offers in Excess of Premium Listing Frithville Gardens, Shepherds Bush Terraced 6 bedrooms 6 3 bathrooms 3 A delightful five bedroom terraced house offering over 2,300 square feet over four floors with high ceilings and unique architecture. Abundance of light throughout by way of sky lights. Reduced on 07/02/2025 by Kinleigh Folkard & Hayward - Sales, Brook Green Reduced on 07/02/2025 020 3879 5257 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/26 £1,900,000 Freehold Moore Park Mews, London SW6 Detached 3 bedrooms 3 3 bathrooms 3 A rarely available three bedroom Mews house situated within Moore Park Mews, SW6. On entering the property you will find a wide entrance hallway, with inviting double doors leading you to an impressive reception/study room that could also be used as a third bedroom. There is also a modern shower... Added on 20/01/2025 by Knight Frank, Fulham Added on 20/01/2025 020 3873 8396 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/12 £1,895,000 Old Yard, Queens Park, London, NW10, United Kingdom Town House 4 bedrooms 4 2 bathrooms 2 Sophisticated Four-Bedroom Townhouse in Queen’s Park Added on 11/12/2024 by United Kingdom Sotheby's International Realty (GPM Principal Branch), Mayfair Added on 11/12/2024 020 3835 2136 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/11 £1,895,000 Premium Listing Sadlers Gate Mews, Commondale, London, SW15 Terraced 4 bedrooms 4 3 bathrooms 3 An immaculately presented four-bedroom house located in this prestigious development opposite Putney Common. This four-bedroom, three-bathroom home offers an excellent balance of reception and bedroom space. The fully fitted kitchen, living and dining room is set over two floors and be... Added on 02/01/2025 by Winkworth, Putney Added on 02/01/2025 020 3823 6033 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/9 £1,895,000 Leisure Facility Trinity Church Road,\nBarnes, SW13 Terraced 4 bedrooms 4 3 bathrooms 3 A wonderful townhouse, in the popular Harrods Village development. With over 2,000 sq.ft. of internal space, this generous property is set over three floors and boasts a landscaped garden, a terrace, two balconies, a garage and off-street parking. Added on 14/01/2025 by Chestertons, Barnes Village Added on 14/01/2025 020 3869 5674 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/20 £1,895,000 Old Yard, London, NW10 Terraced 4 bedrooms 4 3 bathrooms 3 Set in a private courtyard, this award-winning four-bedroom home is a masterclass in sculptural design and tactile materials. Added yesterday by Rigby & Marchant, North Kensington Added yesterday 020 3910 6761 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save 1/15 £1,895,000 Guide Price Generous Garden Brackenbury Road, London W6 Terraced 3 bedrooms 3 1 bathroom 1 A truly wonderful 3 double bedroom Victorian terraced house with two floors of amazing living/entertaining space and a fabulous 42\" walled garden. The lower ground floor has been opened up from front to back with the kitchen/breakfast room to the front and the extended dining/family room beyond. ... Added on 19/10/2024 by Finlay Brewer, London W6 Added on 19/10/2024 020 3907 3362 Local call rate Click to call an agent Call Click to email an agent Contact Click to save this property Save Sorry, something went wrong. Please refresh this page or click here to reload Previous Page 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 of 42 Next Edit this area See properties to rent in West London Get ready with a Mortgage in Principle Personalised result in just 20 minutes Find out how much you can borrow Get viewings faster with agents No impact on your credit score Get a Mortgage in Principle Powered by Staying secure when looking for a property Ensure you're up to date with our latest advice on how to avoid fraud or scams when looking for property online. View our security centre to find out more > Sold House Prices View house prices in West London Exploring Related Searches Property for sale in West London Houses for sale in West London 2 bedroom houses for sale in West London 3 bedroom houses for sale in West London 4 bedroom houses for sale in West London 5+ bedroom houses for sale in West London Nearby West London Surrey Central London East London North London Buckinghamshire South East London South West London Hounslow Ruislip Uxbridge Within West London Kensington And Chelsea Ealing Hammersmith And Fulham Hounslow Hillingdon Flats For Sale in West London Studio flats for sale in West London 1 bedroom flats for sale in West London 2 bedroom flats for sale in West London What Other People Are Looking For Detached houses for sale in West London Terraced houses for sale in West London Bungalows for sale in West London Property for auction in West London Shared ownership properties for sale in West London Retirement properties for sale in West London Commercial properties for sale in West London New homes for sale in West London Suggested Links Estate agents in West London Map data © OpenStreetMap contributors. Sold House Prices View house prices in West London Within West London Kensington And Chelsea Ealing Hammersmith And Fulham Hounslow Hillingdon Suggested Links Estate agents in West London Exploring Related Searches Property for sale in West London Houses for sale in West London 2 bedroom houses for sale in West London 3 bedroom houses for sale in West London 4 bedroom houses for sale in West London 5+ bedroom houses for sale in West London Flats For Sale in West London Studio flats for sale in West London 1 bedroom flats for sale in West London 2 bedroom flats for sale in West London Nearby West London Surrey Central London East London North London Buckinghamshire South East London South West London Hounslow Ruislip Uxbridge What Other People Are Looking For Detached houses for sale in West London Terraced houses for sale in West London Bungalows for sale in West London Property for auction in West London Shared ownership properties for sale in West London Retirement properties for sale in West London Commercial properties for sale in West London New homes for sale in West London X Download the Rightmove app Resources Stamp Duty Calculator House Price Index Property\nguides Property news Buyer\nguides Seller\nguides Renter\nguides Landlord guides Student\nguides Removals Energy efficiency Mortgage in Principle Mortgage Calculator Mortgage guides Search Search homes for sale Search homes for rent Commercial for sale Commercial to rent Overseas homes for sale Search sold house prices Find\nan agent Student accommodation Retirement homes New\nhomes Locations Major towns and cities in the UK London Cornwall Glasgow Cardiff Edinburgh Spain France Portugal Rightmove Tech\nblog About Press\ncentre Investor relations Contact us Careers Sign in or create account HomeViews Professional Rightmove\nPlus Data\nServices Advertise on Rightmove Overseas agents and developers Home and property related services Advertise commercial property HomeViews Business Hub Site map Help Cookies Safety\nand Security Terms of Use Privacy Policy Choose your cookies We and our 206 partners store and access personal data, like browsing data or unique identifiers, on your device. Selecting \"I Accept\" enables tracking technologies to support the purposes shown under \"we and our partners process data to provide,\" whereas selecting \"Reject All\" or withdrawing your consent will disable them. If trackers are disabled, some content and ads you see may not be as relevant to you. You can resurface this menu to change your choices or withdraw consent at any time by clicking the Cookies link on the bottom of the webpage [or the floating icon on the bottom-left of the webpage, if applicable]. Your choices will have effect within our Website. For more details, refer to our Privacy Policy. Learn more about how we use cookies. We and our partners process data to provide: Use precise geolocation data. Actively scan device characteristics for identification. Store and/or access information on a device. Personalised advertising and content, advertising and content measurement, audience research and services development. View our partners Reject all Accept all Manage settings"
}